package trollish.ext

object Sindarin2Kana {

  def Default: Seq[(String, String)] = Seq(
    ("\\^" -> "'"),
    ("-" -> "="), // We need placeholders for `-` as we use them as longtones later.
    // hopping
    ("dd" -> "ッd"), ("kk", "ッk"), ("ss", "ッs"), ("tt", "ッt"),
    // closing mouth
    ("mb" -> "nb"), ("f$", "v"), ("ph", "f"),
    // Opening `i`s, like `ia` for `Iarwain`.
    ("^ia" -> "ya"), ("^ii" -> "yi"), ("^iu" -> "yu"), ("^ie" -> "ye"), ("^io" -> "yo"),
    // `r` at a word's tail, like `Sindar`, `Parantir`, `Feanor`.
    ("ar$" -> "a-ru"), ("ir$" -> "ir"), ("or$" -> "o-ru"),
    ("rha" -> "ra"), ("rhi" -> "ri"), ("rhu" -> "ru"), ("rhe" -> "re"), ("rho" -> "ro"),
    ("ra" -> "ラ"), ("ri" -> "リ"), ("ru" -> "ル"), ("re" -> "レ"), ("ro" -> "ロ"),
    ("ir" -> "ia"), ("ur" -> "ua"), ("er" -> "ea"),
    ("i'r" -> "i-a"), ("u'r" -> "u-a"), ("e'r" -> "e-a"),
    ("ach$" -> "aハ"), ("uch$" -> "uフ"), ("och$" -> "oホ"),
    ("ar" -> "aル"),
    ("'" -> "-"),
    ("qw" -> "kw"),
    ("tya" -> "チャ"), ("tyi" -> "チィ"), ("tyu" -> "チュ"), ("tye" -> "チェ"), ("tyo" -> "チョ"),
    ("sha" -> "シャ"), ("shi" -> "シ"), ("shu" -> "シュ"), ("she" -> "シェ"), ("sho" -> "ショ"),
    ("tha" -> "サ"), ("thi" -> "シ"), ("thu" -> "ス"), ("the" -> "セ"), ("tho" -> "ソ"), ("th" -> "ス"),
    ("cha" -> "ハ"), ("chi" -> "ヒ"), ("chu" -> "フ"), ("che" -> "ヘ"), ("cho" -> "ホ"), ("ch" -> "ヒ"),
    ("kha" -> "ハ"), ("khi" -> "ヒ"), ("khu" -> "フ"), ("khe" -> "ヘ"), ("kho" -> "ホ"), ("kh" -> "ヒ"),
    ("dha" -> "ザ"), ("dhi" -> "ジ"), ("dhu" -> "ズ"), ("dhe" -> "ゼ"), ("dho" -> "ゾ"), ("dh" -> "ズ"),
    ("lha" -> "ラ"), ("lhi" -> "リ"), ("lhu" -> "ル"), ("lhe" -> "レ"), ("lho" -> "ロ"),
    ("hwa" -> "ホワ"), ("hwi" -> "フイ"), ("hwu" -> "フウ"), ("hwe" -> "フエ"), ("hwo" -> "フオ"),
    ("hya" -> "ヒャ"), ("hyi" -> "ヒィ"), ("hyu" -> "ヒュ"), ("hye" -> "ヒェ"), ("hyo" -> "ヒョ"),
    ("ya" -> "ヤ"), ("yu" -> "ユ"), ("yo" -> "ヨ"),
    ("my" -> "ミュ"),
    ("ba" -> "バ"), ("bi" -> "ビ"), ("bu" -> "ブ"), ("be" -> "ベ"), ("bo" -> "ボ"),
    ("ca" -> "カ"), ("ci" -> "キ"), ("cu" -> "ク"), ("ce" -> "ケ"), ("co" -> "コ"),
    ("da" -> "ダ"), ("di" -> "ディ"), ("du" -> "ドゥ"), ("de" -> "デ"), ("do" -> "ド"),
    ("fa" -> "ファ"), ("fi" -> "フィ"), ("fu" -> "フ"), ("fe" -> "フェ"), ("fo" -> "フォ"),
    ("ga" -> "ガ"), ("gi" -> "ギ"), ("gu" -> "グ"), ("ge" -> "ゲ"), ("go" -> "ゴ"),
    ("ha" -> "ハ"), ("hi" -> "ヒ"), ("hu" -> "フ"), ("he" -> "ヘ"), ("ho" -> "ホ"),
    ("ja" -> "ジャ"), ("ji" -> "ジ"), ("ju" -> "ジュ"), ("je" -> "ジェ"), ("jo" -> "ジョ"),
    ("ka" -> "カ"), ("ki" -> "キ"), ("ku" -> "ク"), ("ke" -> "ケ"), ("ko" -> "コ"),
    ("la" -> "ラ"), ("li" -> "リ"), ("lu" -> "ル"), ("le" -> "レ"), ("lo" -> "ロ"),
    ("ma" -> "マ"), ("mi" -> "ミ"), ("mu" -> "ム"), ("me" -> "メ"), ("mo" -> "モ"),
    ("na" -> "ナ"), ("ni" -> "ニ"), ("nu" -> "ヌ"), ("ne" -> "ネ"), ("no" -> "ノ"),
    ("pa" -> "パ"), ("pi" -> "ピ"), ("pu" -> "プ"), ("pe" -> "ペ"), ("po" -> "ポ"),
    ("qu" -> "ク"),
    ("sa" -> "サ"), ("si" -> "シ"), ("su" -> "ス"), ("se" -> "セ"), ("so" -> "ソ"),
    ("ta" -> "タ"), ("ti" -> "ティ"), ("tu" -> "トゥ"), ("te" -> "テ"), ("to" -> "ト"),
    ("va" -> "ヴァ"), ("vi" -> "ヴィ"), ("vu" -> "ヴ"), ("ve" -> "ヴェ"), ("vo" -> "ヴォ"),
    ("wa" -> "ワ"), ("wi" -> "ウィ"), ("wu" -> "ウ"), ("we" -> "ウェ"), ("wo" -> "ウォ"),
    ("za" -> "ザ"), ("zi" -> "ジ"), ("zu" -> "ズ"), ("ze" -> "ゼ"), ("zo" -> "ゾ"),
    ("b" -> "ブ"), ("c" -> "ク"), ("d" -> "ド"), ("f" -> "フ"), ("g" -> "グ"),
    ("h" -> "フ"), ("j" -> "ジュ"), ("k" -> "ク"), ("l" -> "ル"), ("m" -> "ム"),
    ("n" -> "ン"), ("p" -> "プ"), ("q" -> "ク"), ("r" -> "ル"), ("s" -> "ス"),
    ("t" -> "ト"), ("v" -> "ヴ"), ("w" -> "ウ"), ("y" -> "イ"), ("z" -> "ズ"),
    ("a" -> "ア"), ("i" -> "イ"), ("u" -> "ウ"), ("e" -> "エ"), ("o" -> "オ"),
    ("-" -> "ー")
  )
}